In [1]:
import pandas as pd
import numpy as np
import os


os.chdir('C:/wamp64/www/PROG8245-MachineLearingPrograming/Week_6_DataTransformation/data')
# --- IGNORE ---
# Load Student data from CSV file
student_df = pd.read_csv('student.csv')

# Load Mark data from CSV file
mark_df = pd.read_csv('mark.csv')

# Display the DataFrames
# display(student_df) 
# display(mark_df)
# --- IGNORE ---
display(student_df , mark_df)

     Student_id  Age  Gender      Grade Employed
0             1   19    Male  1st Class      yes
1             2   20  Female  2nd Class       no
2             3   18    Male  1st Class       no
3             4   21  Female  2nd Class       no
4             5   19    Male  1st Class       no
..          ...  ...     ...        ...      ...
227         228   21  Female  1st Class       no
228         229   20    Male  2nd Class       no
229         230   20    Male  3rd Class      yes
230         231   19  Female  1st Class      yes
231         232   20    Male  3rd Class      yes

[232 rows x 5 columns]

     Student_id  Mark     City
0             1    95  Chennai
1             2    70    Delhi
2             3    98   Mumbai
3             4    75     Pune
4             5    89    Kochi
..          ...   ...      ...
227         228    99     Pune
228         229    70  Chennai
229         230    55    Delhi
230         231    97   Mumbai
231         232    59     Pune

[232 rows x 3 columns]

In [2]:
# Merge dataframes on Student_id column
merged_student_marks_df = pd.merge(student_df, mark_df, on='Student_id')
merged_student_marks_df

     Student_id  Age  Gender      Grade Employed  Mark     City
0             1   19    Male  1st Class      yes    95  Chennai
1             2   20  Female  2nd Class       no    70    Delhi
2             3   18    Male  1st Class       no    98   Mumbai
3             4   21  Female  2nd Class       no    75     Pune
4             5   19    Male  1st Class       no    89    Kochi
..          ...  ...     ...        ...      ...   ...      ...
227         228   21  Female  1st Class       no    99     Pune
228         229   20    Male  2nd Class       no    70  Chennai
229         230   20    Male  3rd Class      yes    55    Delhi
230         231   19  Female  1st Class      yes    97   Mumbai
231         232   20    Male  3rd Class      yes    59     Pune

[232 rows x 7 columns]

### pd.merge() Relationship Type 
- 1-1
- 1-M
- M-M

In [3]:
# Create a DataFrame for Employee details
employee_df = pd.DataFrame({
    'Name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'Department': ['Accounting', 'Engineering', 'Engineering', 'HR']
})

display(employee_df)

   Name   Department
0   Bob   Accounting
1  Jake  Engineering
2  Lisa  Engineering
3   Sue           HR

In [4]:
# 1-1 Relationship Example
# Create a DataFrame for Employee Hire Dates with potential multiple hire dates for some employees
employee_hire_date_df = pd.DataFrame({
    'Name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'Hire_Date': ['2020-01-15', '2021-07-30', '2018-11-12', '2020-06-01']
})

# Display the Employee Hire Date DataFrame
display(employee_hire_date_df)

   Name   Hire_Date
0   Bob  2020-01-15
1  Jake  2021-07-30
2  Lisa  2018-11-12
3   Sue  2020-06-01

In [5]:
# Merge employee_df with employee_hire_date_df on Employee_id to demonstrate 1-1 relationship
merged_employee_hire_df = pd.merge(employee_df, employee_hire_date_df)
merged_employee_hire_df

   Name   Department   Hire_Date
0   Bob   Accounting  2020-01-15
1  Jake  Engineering  2021-07-30
2  Lisa  Engineering  2018-11-12
3   Sue           HR  2020-06-01

In [6]:
# Now Department manager DataFrame
department_manager_df = pd.DataFrame({'manager': ['Sam', 'Charlie' , 'John'],
                                      'Department': ['Accounting', 'Engineering', 'HR']})

display(department_manager_df)

   manager   Department
0      Sam   Accounting
1  Charlie  Engineering
2     John           HR

In [7]:
# 1 to many relationship example
merged_employee_department_df = pd.merge(employee_df, department_manager_df)
merged_employee_department_df

   Name   Department  manager
0   Bob   Accounting      Sam
1  Jake  Engineering  Charlie
2  Lisa  Engineering  Charlie
3   Sue           HR     John

In [8]:
# many to many relationship example
# required skills: SQL, pandas, Excel
# employees: Bob, Lisa, Sue

required_group_skills_df = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'HR'],
                                            'skill': ['math', 'Excel', 'SQL', 'Problem Solving']})
display(required_group_skills_df)

         group            skill
0   Accounting             math
1   Accounting            Excel
2  Engineering              SQL
3           HR  Problem Solving

In [9]:
# many to many relationship merge
merged_employee_skills_df = pd.merge(employee_df, department_manager_df, on='Department')
merged_employee_skills_df

   Name   Department  manager
0   Bob   Accounting      Sam
1  Jake  Engineering  Charlie
2  Lisa  Engineering  Charlie
3   Sue           HR     John

In [10]:
# pd.merge() arguments
# how: 'inner' (default), 'outer', 'left', 'right'

#Exaple of dataframes with  First Names repaeating
employee_df1 = pd.DataFrame({'First Name': ['John', 'Jane', 'Jim', 'John'],
                    'Last Name': ['Doe', 'Smith', 'Brown', 'Davis'],
                    'Department': ['Accounting', 'Engineering', 'Engineering', 'HR']})


employee_hire_date_df1 = pd.DataFrame({'First Name': ['John', 'Jane', 'Jim', 'John'],
                                      'Last Name': ['Doe', 'Smith', 'Brown', 'Davis'],
                        'Hire Date': ['2020-01-15', '2021-07-30', '2018-11-12', '2020-06-01']})

display(employee_df1, employee_hire_date_df1)

  First Name Last Name   Department
0       John       Doe   Accounting
1       Jane     Smith  Engineering
2        Jim     Brown  Engineering
3       John     Davis           HR

  First Name Last Name   Hire Date
0       John       Doe  2020-01-15
1       Jane     Smith  2021-07-30
2        Jim     Brown  2018-11-12
3       John     Davis  2020-06-01

In [11]:
# salary dataframe with first names and salary
employee_salary_df1 = pd.DataFrame({'First Name': ['John', 'Jane', 'Jim', 'John'],
                                     'Salary': [70000, 80000, 60000, 75000]})

display(employee_salary_df1)

  First Name  Salary
0       John   70000
1       Jane   80000
2        Jim   60000
3       John   75000

In [12]:
# DataSet with name and food 
employee_food_df = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                                  'food': ['Pizza', 'Pasta', 'Burger']})
# Dataset with name and drink
employee_drink_df = pd.DataFrame({'name': ['Joseph', 'Carla', 'Mary'],
                                   'drink': ['Coke', 'Pepsi', 'Juice']})
# Display the DataFrames
print("Employee Food and Drink DataFrames:")
display(employee_food_df, employee_drink_df)

# Inner Join
inner_join_df = pd.merge(employee_food_df, employee_drink_df, on='name', how='inner')
print("Inner Join DataFrame:")
display(inner_join_df)

# Outer Join
outer_join_df = pd.merge(employee_food_df, employee_drink_df, on='name', how='outer')
print("Outer Join DataFrame:")
display(outer_join_df)

# Left Join
left_join_df = pd.merge(employee_food_df, employee_drink_df, on='name', how='left')
print("Left Join DataFrame:")
display(left_join_df)

# Right Join
right_join_df = pd.merge(employee_food_df, employee_drink_df, on='name', how='right')
print("Right Join DataFrame (food - drink):")
display(right_join_df)
# --- IGNORE ---
print("Right Join DataFrame (drink - food):")
right_join_df2 = pd.merge(employee_drink_df, employee_food_df, on='name', how='right')
display(right_join_df2)

Employee Food and Drink DataFrames:

    name    food
0  Peter   Pizza
1   Paul   Pasta
2   Mary  Burger

     name  drink
0  Joseph   Coke
1   Carla  Pepsi
2    Mary  Juice

Inner Join DataFrame:

   name    food  drink
0  Mary  Burger  Juice

Outer Join DataFrame:

     name    food  drink
0   Carla     NaN  Pepsi
1  Joseph     NaN   Coke
2    Mary  Burger  Juice
3    Paul   Pasta    NaN
4   Peter   Pizza    NaN

Left Join DataFrame:

    name    food  drink
0  Peter   Pizza    NaN
1   Paul   Pasta    NaN
2   Mary  Burger  Juice

Right Join DataFrame (food - drink):

     name    food  drink
0  Joseph     NaN   Coke
1   Carla     NaN  Pepsi
2    Mary  Burger  Juice

Right Join DataFrame (drink - food):

    name  drink    food
0  Peter    NaN   Pizza
1   Paul    NaN   Pasta
2   Mary  Juice  Burger